TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
    return (DL_I2C_TARGET_PEC_CHECK_ERROR)(status);
}

/**
 *  @brief      Get target TX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the TX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2C_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2C_TX_FIFO_LEVEL DL_I2C_getTargetTXFIFOThreshold(
    const I2C_Regs *i2c)
{
    uint32_t level = i2c->SLAVE.SFIFOCTL & I2C_SFIFOCTL_TXTRIG_MASK;

    return (DL_I2C_TX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set target TX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2C_TX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2C_setTargetTXFIFOThreshold(
    I2C_Regs *i2c, DL_I2C_TX_FIFO_LEVEL level)
{
    DL_Common_updateReg(&i2c->SLAVE.SFIFOCTL, (uint32_t) level,
        (uint32_t) I2C_SFIFOCTL_TXTRIG_MASK);
}

/**
 *  @brief      Stop target TX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2C_isTargetTXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_stopFlushTargetTXFIFO(I2C_Regs *i2c)
{
    i2c->SLAVE.SFIFOCTL &= ~(I2C_SFIFOCTL_TXFLUSH_MASK);
}

/**
 *  @brief      Start target TX FIFO flush
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_startFlushTargetTXFIFO(I2C_Regs *i2c)
{
    i2c->SLAVE.SFIFOCTL |= I2C_SFIFOCTL_TXFLUSH_MASK;
}

/**
 *  @brief      Stop target RX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2C_isTargetRXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_stopFlushTargetRXFIFO(I2C_Regs *i2c)
{
    i2c->SLAVE.SFIFOCTL &= ~(I2C_SFIFOCTL_RXFLUSH_MASK);
}

/**
 *  @brief      Start target RX FIFO flush
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_startFlushTargetRXFIFO(I2C_Regs *i2c)
{
    i2c->SLAVE.SFIFOCTL |= I2C_SFIFOCTL_RXFLUSH_MASK;
}

/**
 *  @brief      Get target RX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the RX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2C_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2C_RX_FIFO_LEVEL DL_I2C_getTargetRXFIFOThreshold(
    const I2C_Regs *i2c)
{
    uint32_t level = i2c->SLAVE.SFIFOCTL & I2C_SFIFOCTL_RXTRIG_MASK;

    return (DL_I2C_RX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set target RX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2C_RX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2C_setTargetRXFIFOThreshold(
    I2C_Regs *i2c, DL_I2C_RX_FIFO_LEVEL level)
{
    DL_Common_updateReg(
        &i2c->SLAVE.SFIFOCTL, (uint32_t) level, I2C_SFIFOCTL_RXTRIG_MASK);
}

/**
 *  @brief      Get number of bytes which can be read from RX FIFO
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be read from RX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetRXFIFOCounter(const I2C_Regs *i2c)
{
    return (i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFIFOCNT_MASK);
}

/**
 *  @brief      Get number of bytes which can be put into TX FIFO
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be put into TX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetTXFIFOCounter(const I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) >>
            I2C_SFIFOSR_TXFIFOCNT_OFS);
}

/**
 *  @brief      Checks if target RX FIFO flush is active
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target RX FIFO flush is active
 *
 *  @retval     true if target RX FIFO flush is active
 *  @retval     false if target RX FIFO flush is not active
 */
__STATIC_INLINE bool DL_I2C_isTargetRXFIFOFlushActive(const I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFLUSH_MASK) ==
            I2C_SFIFOSR_RXFLUSH_ACTIVE);
}

/**
 *  @brief      Checks if target TX FIFO flush is active
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target TX FIFO flush is active
 *
 *  @retval     true if target TX FIFO flush is active
 *  @retval     false if target TX FIFO flush is not active
 */
__STATIC_INLINE bool DL_I2C_isTargetTXFIFOFlushActive(const I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFLUSH_MASK) ==
            I2C_SFIFOSR_TXFLUSH_ACTIVE);
}

/**
 *  @brief      Enable I2C interrupts
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 */
__STATIC_INLINE void DL_I2C_enableInterrupt(
    I2C_Regs *i2c, uint32_t interruptMask)
{
    i2c->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable I2C interrupts
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 */
__STATIC_INLINE void DL_I2C_disableInterrupt(
    I2C_Regs *i2c, uint32_t interruptMask)
{
    i2c->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which I2C interrupts are enabled
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 *
 *  @return     Which of the requested I2C interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2C_getEnabledInterrupts(
    const I2C_Regs *i2c, uint32_t interruptMask)
{
    return (i2c->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled I2C interrupts
 *
 *  Checks if any of the I2C interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 *
 *  @return     Which of the requested I2C interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
 *
 *  @sa         DL_I2C_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_I2C_getEnabledInterruptStatus(
    const I2C_Regs *i2c, uint32_t interruptMask)
{
    return (i2c->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any I2C interrupt
 *
 *  Checks if any of the I2C interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 *
 *  @return     Which of the requested I2C interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2C_getRawInterruptStatus(
    const I2C_Regs *i2c, uint32_t interruptMask)
{
    return (i2c->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending I2C interrupt
 *
 *  Checks if any of the I2C interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  i2c  Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending I2C interrupt
 *
 *  @retval     One of @ref DL_I2C_IIDX
 */
__STATIC_INLINE DL_I2C_IIDX DL_I2C_getPendingInterrupt(const I2C_Regs *i2c)
{
    return ((DL_I2C_IIDX) i2c->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending I2C interrupts
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_I2C_INTERRUPT.
 */
__STATIC_INLINE void DL_I2C_clearInterruptStatus(
    I2C_Regs *i2c, uint32_t interruptMask)
{
    i2c->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief Enables I2C interrupt for triggering DMA events
 *
 * Enables the I2C interrupt to be used as the condition to generate an
 * event to directly trigger the DMA.
 *
 * Each event publisher @ref DL_I2C_EVENT_ROUTE can set any one of
 * @ref DL_I2C_DMA_INTERRUPT.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  i2c        Pointer to the register overlay for the peripheral
 *  @param[in]  index      Specifies the register event publisher to configure
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_I2C_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2C_enableDMAEvent(
    I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interrupt)
{
    switch (index) {
        case DL_I2C_EVENT_ROUTE_1:
            i2c->DMA_TRIG1.IMASK = interrupt;
            break;
        case DL_I2C_EVENT_ROUTE_2:
            i2c->DMA_TRIG0.IMASK = interrupt;
            break;
        default:
            break;
    }
}

/**
 *  @brief Disables I2C interrupt from triggering DMA events
 *
 * Disables the I2C interrupt from being used as the condition to generate an
 * event to directly trigger the DMA.
 *
 * Each event publisher @ref DL_I2C_EVENT_ROUTE can set any one of
 * @ref DL_I2C_DMA_INTERRUPT.
 *
 *  @param[in]  i2c        Pointer to the register overlay for the peripheral
 *  @param[in]  index      Specifies the register event publisher to configure
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_I2C_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2C_disableDMAEvent(
    I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interrupt)
{
    switch (index) {
        case DL_I2C_EVENT_ROUTE_1:
            i2c->DMA_TRIG1.IMASK &= ~(interrupt);
            break;
        case DL_I2C_EVENT_ROUTE_2:
            i2c->DMA_TRIG0.IMASK &= ~(interrupt);
            break;
        default:
            break;
    }
}

/**
 *  @brief Check which I2C interrupt for DMA receive events is enabled
 *
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2C_EVENT_ROUTE, which are used for triggering the DMA for
 *  Controller or Target and receive or transmit events.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2C interrupt status
 *
 *  @retval     One of @ref DL_I2C_DMA_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_I2C_getEnabledDMAEvents(
    I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
{
    volatile uint32_t *pReg = &i2c->DMA_TRIG1.IMASK;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief Check interrupt flag of enabled I2C interrupt for DMA event
 *
 *  Checks if any of the I2C interrupts for the DMA receive event that were
 *  previously enabled are pending.
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2C_EVENT_ROUTE, which are used for triggering the DMA for
 *  Controller or Target and receive or transmit events.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2C interrupt status
 *
 *  @retval     One of @ref DL_I2C_DMA_INTERRUPT
 *
 *  @sa         DL_I2C_enableDMAEvent
 */
__STATIC_INLINE uint32_t DL_I2C_getEnabledDMAEventStatus(
    const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
{
    const volatile uint32_t *pReg = &i2c->DMA_TRIG1.MIS;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief Check interrupt flag of any I2C interrupt for DMA event
 *
 *  Checks if any of the I2C interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2C_EVENT_ROUTE, which are used for triggering the DMA for
 *  Controller or Target and receive or transmit events.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2C_DMA_INTERRUPT.
 *
 *  @return     Which of the requested I2C interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2C_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2C_getRawDMAEventStatus(
    const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
{
    const volatile uint32_t *pReg = &i2c->DMA_TRIG1.RIS;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief Get highest priority pending I2C interrupt for DMA  event
 *
 *  Checks if any of the I2C interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2C_EVENT_ROUTE, which are used for triggering the DMA for
 *  Controller or Target and receive or transmit events.
 *
 *  @param[in]  i2c        Pointer to the register overlay for the peripheral
 *  @param[in]  index      Specifies the register event publisher to configure
 *
 *  @return     The highest priority pending I2C interrupt
 *
 *  @retval     One of @ref DL_I2C_DMA_IIDX
 */
__STATIC_INLINE DL_I2C_DMA_IIDX DL_I2C_getPendingDMAEvent(
    const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index)
{
    const volatile uint32_t *pReg = &i2c->DMA_TRIG1.IIDX;

